Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
extern volatile __ADCFLTR4bits_t ADCFLTR4bits __asm__ ("ADCFLTR4") __attribute__((section("sfrs"), address(0xBF8871D0)));
extern volatile uint32_t        ADCFLTR4CLR __attribute__((section("sfrs"),address(0xBF8871D4)));
extern volatile uint32_t        ADCFLTR4SET __attribute__((section("sfrs"),address(0xBF8871D8)));
extern volatile uint32_t        ADCFLTR4INV __attribute__((section("sfrs"),address(0xBF8871DC)));
#define ADCTRG1 ADCTRG1
extern volatile uint32_t   ADCTRG1 __attribute__((section("sfrs"), address(0xBF887200)));
typedef struct {
  uint32_t TRGSRC0:5;
  uint32_t :3;
  uint32_t TRGSRC1:5;
  uint32_t :3;
  uint32_t TRGSRC2:5;
  uint32_t :3;
  uint32_t TRGSRC3:5;
} __ADCTRG1bits_t;
extern volatile __ADCTRG1bits_t ADCTRG1bits __asm__ ("ADCTRG1") __attribute__((section("sfrs"), address(0xBF887200)));
extern volatile uint32_t        ADCTRG1CLR __attribute__((section("sfrs"),address(0xBF887204)));
extern volatile uint32_t        ADCTRG1SET __attribute__((section("sfrs"),address(0xBF887208)));
extern volatile uint32_t        ADCTRG1INV __attribute__((section("sfrs"),address(0xBF88720C)));
#define ADCTRG2 ADCTRG2
extern volatile uint32_t   ADCTRG2 __attribute__((section("sfrs"), address(0xBF887210)));
typedef struct {
  uint32_t TRGSRC4:5;
  uint32_t :3;
  uint32_t TRGSRC5:5;
  uint32_t :3;
  uint32_t TRGSRC6:5;
  uint32_t :3;
  uint32_t TRGSRC7:5;
} __ADCTRG2bits_t;
extern volatile __ADCTRG2bits_t ADCTRG2bits __asm__ ("ADCTRG2") __attribute__((section("sfrs"), address(0xBF887210)));
extern volatile uint32_t        ADCTRG2CLR __attribute__((section("sfrs"),address(0xBF887214)));
extern volatile uint32_t        ADCTRG2SET __attribute__((section("sfrs"),address(0xBF887218)));
extern volatile uint32_t        ADCTRG2INV __attribute__((section("sfrs"),address(0xBF88721C)));
#define ADCTRG3 ADCTRG3
extern volatile uint32_t   ADCTRG3 __attribute__((section("sfrs"), address(0xBF887220)));
typedef struct {
  uint32_t TRGSRC8:5;
  uint32_t :3;
  uint32_t TRGSRC9:5;
  uint32_t :3;
  uint32_t TRGSRC10:5;
  uint32_t :3;
  uint32_t TRGSRC11:5;
} __ADCTRG3bits_t;
extern volatile __ADCTRG3bits_t ADCTRG3bits __asm__ ("ADCTRG3") __attribute__((section("sfrs"), address(0xBF887220)));
extern volatile uint32_t        ADCTRG3CLR __attribute__((section("sfrs"),address(0xBF887224)));
extern volatile uint32_t        ADCTRG3SET __attribute__((section("sfrs"),address(0xBF887228)));
extern volatile uint32_t        ADCTRG3INV __attribute__((section("sfrs"),address(0xBF88722C)));
#define ADCTRG4 ADCTRG4
extern volatile uint32_t   ADCTRG4 __attribute__((section("sfrs"), address(0xBF887230)));
typedef struct {
  uint32_t TRGSRC12:5;
  uint32_t :3;
  uint32_t TRGSRC13:5;
  uint32_t :3;
  uint32_t TRGSRC14:5;
  uint32_t :3;
  uint32_t TRGSRC15:5;
} __ADCTRG4bits_t;
extern volatile __ADCTRG4bits_t ADCTRG4bits __asm__ ("ADCTRG4") __attribute__((section("sfrs"), address(0xBF887230)));
extern volatile uint32_t        ADCTRG4CLR __attribute__((section("sfrs"),address(0xBF887234)));
extern volatile uint32_t        ADCTRG4SET __attribute__((section("sfrs"),address(0xBF887238)));
extern volatile uint32_t        ADCTRG4INV __attribute__((section("sfrs"),address(0xBF88723C)));
#define ADCTRG5 ADCTRG5
extern volatile uint32_t   ADCTRG5 __attribute__((section("sfrs"), address(0xBF887240)));
typedef struct {
  uint32_t TRGSRC16:5;
  uint32_t :3;
  uint32_t TRGSRC17:5;
  uint32_t :3;
  uint32_t TRGSRC18:5;
  uint32_t :3;
  uint32_t TRGSRC19:5;
} __ADCTRG5bits_t;
extern volatile __ADCTRG5bits_t ADCTRG5bits __asm__ ("ADCTRG5") __attribute__((section("sfrs"), address(0xBF887240)));
extern volatile uint32_t        ADCTRG5CLR __attribute__((section("sfrs"),address(0xBF887244)));
extern volatile uint32_t        ADCTRG5SET __attribute__((section("sfrs"),address(0xBF887248)));
extern volatile uint32_t        ADCTRG5INV __attribute__((section("sfrs"),address(0xBF88724C)));
#define ADCTRG7 ADCTRG7
extern volatile uint32_t   ADCTRG7 __attribute__((section("sfrs"), address(0xBF887260)));
typedef struct {
  uint32_t TRGSRC24:5;
  uint32_t :3;
  uint32_t TRGSRC25:5;
  uint32_t :3;
  uint32_t TRGSRC26:5;
  uint32_t :3;
  uint32_t TRGSRC27:5;
} __ADCTRG7bits_t;
extern volatile __ADCTRG7bits_t ADCTRG7bits __asm__ ("ADCTRG7") __attribute__((section("sfrs"), address(0xBF887260)));
extern volatile uint32_t        ADCTRG7CLR __attribute__((section("sfrs"),address(0xBF887264)));
extern volatile uint32_t        ADCTRG7SET __attribute__((section("sfrs"),address(0xBF887268)));
extern volatile uint32_t        ADCTRG7INV __attribute__((section("sfrs"),address(0xBF88726C)));
#define ADCCMPCON1 ADCCMPCON1
extern volatile uint32_t   ADCCMPCON1 __attribute__((section("sfrs"), address(0xBF887280)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:6;
  uint32_t :2;
  uint32_t CVDDATA:16;
} __ADCCMPCON1bits_t;
extern volatile __ADCCMPCON1bits_t ADCCMPCON1bits __asm__ ("ADCCMPCON1") __attribute__((section("sfrs"), address(0xBF887280)));
extern volatile uint32_t        ADCCMPCON1CLR __attribute__((section("sfrs"),address(0xBF887284)));
extern volatile uint32_t        ADCCMPCON1SET __attribute__((section("sfrs"),address(0xBF887288)));
extern volatile uint32_t        ADCCMPCON1INV __attribute__((section("sfrs"),address(0xBF88728C)));
#define ADCCMPCON2 ADCCMPCON2
extern volatile uint32_t   ADCCMPCON2 __attribute__((section("sfrs"), address(0xBF887290)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON2bits_t;
extern volatile __ADCCMPCON2bits_t ADCCMPCON2bits __asm__ ("ADCCMPCON2") __attribute__((section("sfrs"), address(0xBF887290)));
extern volatile uint32_t        ADCCMPCON2CLR __attribute__((section("sfrs"),address(0xBF887294)));
extern volatile uint32_t        ADCCMPCON2SET __attribute__((section("sfrs"),address(0xBF887298)));
extern volatile uint32_t        ADCCMPCON2INV __attribute__((section("sfrs"),address(0xBF88729C)));
#define ADCCMPCON3 ADCCMPCON3
extern volatile uint32_t   ADCCMPCON3 __attribute__((section("sfrs"), address(0xBF8872A0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON3bits_t;
extern volatile __ADCCMPCON3bits_t ADCCMPCON3bits __asm__ ("ADCCMPCON3") __attribute__((section("sfrs"), address(0xBF8872A0)));
extern volatile uint32_t        ADCCMPCON3CLR __attribute__((section("sfrs"),address(0xBF8872A4)));
extern volatile uint32_t        ADCCMPCON3SET __attribute__((section("sfrs"),address(0xBF8872A8)));
extern volatile uint32_t        ADCCMPCON3INV __attribute__((section("sfrs"),address(0xBF8872AC)));
#define ADCCMPCON4 ADCCMPCON4
extern volatile uint32_t   ADCCMPCON4 __attribute__((section("sfrs"), address(0xBF8872B0)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON4bits_t;
extern volatile __ADCCMPCON4bits_t ADCCMPCON4bits __asm__ ("ADCCMPCON4") __attribute__((section("sfrs"), address(0xBF8872B0)));
extern volatile uint32_t        ADCCMPCON4CLR __attribute__((section("sfrs"),address(0xBF8872B4)));
extern volatile uint32_t        ADCCMPCON4SET __attribute__((section("sfrs"),address(0xBF8872B8)));
extern volatile uint32_t        ADCCMPCON4INV __attribute__((section("sfrs"),address(0xBF8872BC)));
#define ADCBASE ADCBASE
extern volatile uint32_t   ADCBASE __attribute__((section("sfrs"), address(0xBF887300)));
typedef struct {
  uint32_t ADCBASE:16;
} __ADCBASEbits_t;
extern volatile __ADCBASEbits_t ADCBASEbits __asm__ ("ADCBASE") __attribute__((section("sfrs"), address(0xBF887300)));
extern volatile uint32_t        ADCBASECLR __attribute__((section("sfrs"),address(0xBF887304)));
extern volatile uint32_t        ADCBASESET __attribute__((section("sfrs"),address(0xBF887308)));
extern volatile uint32_t        ADCBASEINV __attribute__((section("sfrs"),address(0xBF88730C)));
#define ADCDSTAT ADCDSTAT
extern volatile uint32_t   ADCDSTAT __attribute__((section("sfrs"), address(0xBF887310)));
typedef struct {
  uint32_t RAF0:1;
  uint32_t RAF1:1;
  uint32_t RAF2:1;
  uint32_t RAF3:1;
  uint32_t RAF4:1;
  uint32_t RAF5:1;
  uint32_t :2;
  uint32_t RAFIEN0:1;
  uint32_t RAFIEN1:1;
  uint32_t RAFIEN2:1;
  uint32_t RAFIEN3:1;
  uint32_t RAFIEN4:1;
  uint32_t RAFIEN5:1;
  uint32_t :1;
  uint32_t DMACEN:1;
  uint32_t RBF0:1;
  uint32_t RBF1:1;
  uint32_t RBF2:1;
  uint32_t RBF3:1;
  uint32_t RBF4:1;
  uint32_t RBF5:1;
  uint32_t :1;
  uint32_t WOVERR:1;
  uint32_t RBFIEN0:1;
  uint32_t RBFIEN1:1;
  uint32_t RBFIEN2:1;
  uint32_t RBFIEN3:1;
  uint32_t RBFIEN4:1;
  uint32_t RBFIEN5:1;
  uint32_t :1;
  uint32_t DMAEN:1;
} __ADCDSTATbits_t;
