Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern CNNEB            /* 0xBF8601A0 */
  .extern CNNEBCLR         /* 0xBF8601A4 */
  .extern CNNEBSET         /* 0xBF8601A8 */
  .extern CNNEBINV         /* 0xBF8601AC */
  .extern CNFB             /* 0xBF8601B0 */
  .extern CNFBCLR          /* 0xBF8601B4 */
  .extern CNFBSET          /* 0xBF8601B8 */
  .extern CNFBINV          /* 0xBF8601BC */
  .extern SRCON0B          /* 0xBF8601C0 */
  .extern SRCON0BCLR       /* 0xBF8601C4 */
  .extern SRCON0BSET       /* 0xBF8601C8 */
  .extern SRCON0BINV       /* 0xBF8601CC */
  .extern SRCON1B          /* 0xBF8601D0 */
  .extern SRCON1BCLR       /* 0xBF8601D4 */
  .extern SRCON1BSET       /* 0xBF8601D8 */
  .extern SRCON1BINV       /* 0xBF8601DC */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNNECCLR         /* 0xBF8602A4 */
  .extern CNNECSET         /* 0xBF8602A8 */
  .extern CNNECINV         /* 0xBF8602AC */
  .extern CNFC             /* 0xBF8602B0 */
  .extern CNFCCLR          /* 0xBF8602B4 */
  .extern CNFCSET          /* 0xBF8602B8 */
  .extern CNFCINV          /* 0xBF8602BC */
  .extern SRCON0C          /* 0xBF8602C0 */
  .extern SRCON0CCLR       /* 0xBF8602C4 */
  .extern SRCON0CSET       /* 0xBF8602C8 */
  .extern SRCON0CINV       /* 0xBF8602CC */
  .extern SRCON1C          /* 0xBF8602D0 */
  .extern SRCON1CCLR       /* 0xBF8602D4 */
  .extern SRCON1CSET       /* 0xBF8602D8 */
  .extern SRCON1CINV       /* 0xBF8602DC */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNNEDCLR         /* 0xBF8603A4 */
  .extern CNNEDSET         /* 0xBF8603A8 */
  .extern CNNEDINV         /* 0xBF8603AC */
  .extern CNFD             /* 0xBF8603B0 */
  .extern CNFDCLR          /* 0xBF8603B4 */
  .extern CNFDSET          /* 0xBF8603B8 */
  .extern CNFDINV          /* 0xBF8603BC */
  .extern SRCON0D          /* 0xBF8603C0 */
  .extern SRCON0DCLR       /* 0xBF8603C4 */
  .extern SRCON0DSET       /* 0xBF8603C8 */
  .extern SRCON0DINV       /* 0xBF8603CC */
  .extern SRCON1D          /* 0xBF8603D0 */
  .extern SRCON1DCLR       /* 0xBF8603D4 */
  .extern SRCON1DSET       /* 0xBF8603D8 */
  .extern SRCON1DINV       /* 0xBF8603DC */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
  .extern CNCONESET        /* 0xBF860478 */
  .extern CNCONEINV        /* 0xBF86047C */
  .extern CNENE            /* 0xBF860480 */
  .extern CNENECLR         /* 0xBF860484 */
  .extern CNENESET         /* 0xBF860488 */
  .extern CNENEINV         /* 0xBF86048C */
  .extern CNSTATE          /* 0xBF860490 */
  .extern CNSTATECLR       /* 0xBF860494 */
  .extern CNSTATESET       /* 0xBF860498 */
  .extern CNSTATEINV       /* 0xBF86049C */
  .extern CNNEE            /* 0xBF8604A0 */
  .extern CNNEECLR         /* 0xBF8604A4 */
  .extern CNNEESET         /* 0xBF8604A8 */
  .extern CNNEEINV         /* 0xBF8604AC */
  .extern CNFE             /* 0xBF8604B0 */
  .extern CNFECLR          /* 0xBF8604B4 */
  .extern CNFESET          /* 0xBF8604B8 */
  .extern CNFEINV          /* 0xBF8604BC */
  .extern SRCON0E          /* 0xBF8604C0 */
  .extern SRCON0ECLR       /* 0xBF8604C4 */
  .extern SRCON0ESET       /* 0xBF8604C8 */
  .extern SRCON0EINV       /* 0xBF8604CC */
  .extern SRCON1E          /* 0xBF8604D0 */
  .extern SRCON1ECLR       /* 0xBF8604D4 */
  .extern SRCON1ESET       /* 0xBF8604D8 */
  .extern SRCON1EINV       /* 0xBF8604DC */
  .extern TRISF            /* 0xBF860510 */
  .extern TRISFCLR         /* 0xBF860514 */
  .extern TRISFSET         /* 0xBF860518 */
  .extern TRISFINV         /* 0xBF86051C */
  .extern PORTF            /* 0xBF860520 */
  .extern PORTFCLR         /* 0xBF860524 */
  .extern PORTFSET         /* 0xBF860528 */
  .extern PORTFINV         /* 0xBF86052C */
  .extern LATF             /* 0xBF860530 */
  .extern LATFCLR          /* 0xBF860534 */
  .extern LATFSET          /* 0xBF860538 */
  .extern LATFINV          /* 0xBF86053C */
  .extern ODCF             /* 0xBF860540 */
  .extern ODCFCLR          /* 0xBF860544 */
  .extern ODCFSET          /* 0xBF860548 */
  .extern ODCFINV          /* 0xBF86054C */
  .extern CNPUF            /* 0xBF860550 */
  .extern CNPUFCLR         /* 0xBF860554 */
  .extern CNPUFSET         /* 0xBF860558 */
  .extern CNPUFINV         /* 0xBF86055C */
  .extern CNPDF            /* 0xBF860560 */
  .extern CNPDFCLR         /* 0xBF860564 */
  .extern CNPDFSET         /* 0xBF860568 */
  .extern CNPDFINV         /* 0xBF86056C */
  .extern CNCONF           /* 0xBF860570 */
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern CNNEF            /* 0xBF8605A0 */
  .extern CNNEFCLR         /* 0xBF8605A4 */
  .extern CNNEFSET         /* 0xBF8605A8 */
  .extern CNNEFINV         /* 0xBF8605AC */
  .extern CNFF             /* 0xBF8605B0 */
  .extern CNFFCLR          /* 0xBF8605B4 */
  .extern CNFFSET          /* 0xBF8605B8 */
  .extern CNFFINV          /* 0xBF8605BC */
  .extern SRCON0F          /* 0xBF8605C0 */
  .extern SRCON0FCLR       /* 0xBF8605C4 */
  .extern SRCON0FSET       /* 0xBF8605C8 */
  .extern SRCON0FINV       /* 0xBF8605CC */
  .extern SRCON1F          /* 0xBF8605D0 */
  .extern SRCON1FCLR       /* 0xBF8605D4 */
  .extern SRCON1FSET       /* 0xBF8605D8 */
  .extern SRCON1FINV       /* 0xBF8605DC */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern CNNEG            /* 0xBF8606A0 */
  .extern CNNEGCLR         /* 0xBF8606A4 */
  .extern CNNEGSET         /* 0xBF8606A8 */
  .extern CNNEGINV         /* 0xBF8606AC */
  .extern CNFG             /* 0xBF8606B0 */
  .extern CNFGCLR          /* 0xBF8606B4 */
  .extern CNFGSET          /* 0xBF8606B8 */
  .extern CNFGINV          /* 0xBF8606BC */
  .extern ADCCON1          /* 0xBF887000 */
  .extern ADCCON1CLR       /* 0xBF887004 */
  .extern ADCCON1SET       /* 0xBF887008 */
  .extern ADCCON1INV       /* 0xBF88700C */
  .extern ADCCON2          /* 0xBF887010 */
  .extern ADCCON2CLR       /* 0xBF887014 */
  .extern ADCCON2SET       /* 0xBF887018 */
  .extern ADCCON2INV       /* 0xBF88701C */
  .extern ADCCON3          /* 0xBF887020 */
  .extern ADCCON3CLR       /* 0xBF887024 */
  .extern ADCCON3SET       /* 0xBF887028 */
  .extern ADCCON3INV       /* 0xBF88702C */
  .extern ADCTRGMODE       /* 0xBF887030 */
  .extern ADCTRGMODECLR    /* 0xBF887034 */
  .extern ADCTRGMODESET    /* 0xBF887038 */
  .extern ADCTRGMODEINV    /* 0xBF88703C */
  .extern ADCIMCON1        /* 0xBF887040 */
  .extern ADCIMCON1CLR     /* 0xBF887044 */
  .extern ADCIMCON1SET     /* 0xBF887048 */
  .extern ADCIMCON1INV     /* 0xBF88704C */
  .extern ADCIMCON2        /* 0xBF887050 */
  .extern ADCIMCON2CLR     /* 0xBF887054 */
  .extern ADCIMCON2SET     /* 0xBF887058 */
  .extern ADCIMCON2INV     /* 0xBF88705C */
  .extern ADCIMCON3        /* 0xBF887060 */
  .extern ADCIMCON3CLR     /* 0xBF887064 */
  .extern ADCIMCON3SET     /* 0xBF887068 */
  .extern ADCIMCON3INV     /* 0xBF88706C */
  .extern ADCIMCON4        /* 0xBF887070 */
  .extern ADCIMCON4CLR     /* 0xBF887074 */
  .extern ADCIMCON4SET     /* 0xBF887078 */
  .extern ADCIMCON4INV     /* 0xBF88707C */
  .extern ADCGIRQEN1       /* 0xBF887080 */
  .extern ADCGIRQEN1CLR    /* 0xBF887084 */
  .extern ADCGIRQEN1SET    /* 0xBF887088 */
  .extern ADCGIRQEN1INV    /* 0xBF88708C */
  .extern ADCGIRQEN2       /* 0xBF887090 */
  .extern ADCGIRQEN2CLR    /* 0xBF887094 */
  .extern ADCGIRQEN2SET    /* 0xBF887098 */
  .extern ADCGIRQEN2INV    /* 0xBF88709C */
  .extern ADCCSS1          /* 0xBF8870A0 */
  .extern ADCCSS1CLR       /* 0xBF8870A4 */
  .extern ADCCSS1SET       /* 0xBF8870A8 */
  .extern ADCCSS1INV       /* 0xBF8870AC */
  .extern ADCCSS2          /* 0xBF8870B0 */
  .extern ADCCSS2CLR       /* 0xBF8870B4 */
  .extern ADCCSS2SET       /* 0xBF8870B8 */
  .extern ADCCSS2INV       /* 0xBF8870BC */
  .extern ADCDSTAT1        /* 0xBF8870C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8870C4 */
  .extern ADCDSTAT1SET     /* 0xBF8870C8 */
  .extern ADCDSTAT1INV     /* 0xBF8870CC */
  .extern ADCDSTAT2        /* 0xBF8870D0 */
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
  .extern ADCCMP4CLR       /* 0xBF887154 */
  .extern ADCCMP4SET       /* 0xBF887158 */
  .extern ADCCMP4INV       /* 0xBF88715C */
  .extern ADCFLTR1         /* 0xBF8871A0 */
  .extern ADCFLTR1CLR      /* 0xBF8871A4 */
  .extern ADCFLTR1SET      /* 0xBF8871A8 */
  .extern ADCFLTR1INV      /* 0xBF8871AC */
  .extern ADCFLTR2         /* 0xBF8871B0 */
  .extern ADCFLTR2CLR      /* 0xBF8871B4 */
  .extern ADCFLTR2SET      /* 0xBF8871B8 */
  .extern ADCFLTR2INV      /* 0xBF8871BC */
  .extern ADCFLTR3         /* 0xBF8871C0 */
  .extern ADCFLTR3CLR      /* 0xBF8871C4 */
  .extern ADCFLTR3SET      /* 0xBF8871C8 */
  .extern ADCFLTR3INV      /* 0xBF8871CC */
  .extern ADCFLTR4         /* 0xBF8871D0 */
  .extern ADCFLTR4CLR      /* 0xBF8871D4 */
  .extern ADCFLTR4SET      /* 0xBF8871D8 */
  .extern ADCFLTR4INV      /* 0xBF8871DC */
  .extern ADCTRG1          /* 0xBF887200 */
  .extern ADCTRG1CLR       /* 0xBF887204 */
  .extern ADCTRG1SET       /* 0xBF887208 */
  .extern ADCTRG1INV       /* 0xBF88720C */
  .extern ADCTRG2          /* 0xBF887210 */
  .extern ADCTRG2CLR       /* 0xBF887214 */
  .extern ADCTRG2SET       /* 0xBF887218 */
  .extern ADCTRG2INV       /* 0xBF88721C */
  .extern ADCTRG3          /* 0xBF887220 */
  .extern ADCTRG3CLR       /* 0xBF887224 */
  .extern ADCTRG3SET       /* 0xBF887228 */
  .extern ADCTRG3INV       /* 0xBF88722C */
  .extern ADCTRG4          /* 0xBF887230 */
  .extern ADCTRG4CLR       /* 0xBF887234 */
  .extern ADCTRG4SET       /* 0xBF887238 */
  .extern ADCTRG4INV       /* 0xBF88723C */
  .extern ADCTRG5          /* 0xBF887240 */
  .extern ADCTRG5CLR       /* 0xBF887244 */
  .extern ADCTRG5SET       /* 0xBF887248 */
  .extern ADCTRG5INV       /* 0xBF88724C */
  .extern ADCTRG7          /* 0xBF887260 */
  .extern ADCTRG7CLR       /* 0xBF887264 */
  .extern ADCTRG7SET       /* 0xBF887268 */
  .extern ADCTRG7INV       /* 0xBF88726C */
  .extern ADCCMPCON1       /* 0xBF887280 */
  .extern ADCCMPCON1CLR    /* 0xBF887284 */
  .extern ADCCMPCON1SET    /* 0xBF887288 */
  .extern ADCCMPCON1INV    /* 0xBF88728C */
  .extern ADCCMPCON2       /* 0xBF887290 */
  .extern ADCCMPCON2CLR    /* 0xBF887294 */
  .extern ADCCMPCON2SET    /* 0xBF887298 */
  .extern ADCCMPCON2INV    /* 0xBF88729C */
  .extern ADCCMPCON3       /* 0xBF8872A0 */
  .extern ADCCMPCON3CLR    /* 0xBF8872A4 */
  .extern ADCCMPCON3SET    /* 0xBF8872A8 */
  .extern ADCCMPCON3INV    /* 0xBF8872AC */
  .extern ADCCMPCON4       /* 0xBF8872B0 */
  .extern ADCCMPCON4CLR    /* 0xBF8872B4 */
  .extern ADCCMPCON4SET    /* 0xBF8872B8 */
  .extern ADCCMPCON4INV    /* 0xBF8872BC */
  .extern ADCBASE          /* 0xBF887300 */
  .extern ADCBASECLR       /* 0xBF887304 */
  .extern ADCBASESET       /* 0xBF887308 */
  .extern ADCBASEINV       /* 0xBF88730C */
  .extern ADCDSTAT         /* 0xBF887310 */
  .extern ADCDSTATCLR      /* 0xBF887314 */
  .extern ADCDSTATSET      /* 0xBF887318 */
  .extern ADCDSTATINV      /* 0xBF88731C */
  .extern ADCCNTB          /* 0xBF887320 */
  .extern ADCCNTBCLR       /* 0xBF887324 */
  .extern ADCCNTBSET       /* 0xBF887328 */
  .extern ADCCNTBINV       /* 0xBF88732C */
  .extern ADCDMAB          /* 0xBF887330 */
  .extern ADCDMABCLR       /* 0xBF887334 */
  .extern ADCDMABSET       /* 0xBF887338 */
  .extern ADCDMABINV       /* 0xBF88733C */
  .extern ADCTRGSNS        /* 0xBF887340 */
  .extern ADCTRGSNSCLR     /* 0xBF887344 */
  .extern ADCTRGSNSSET     /* 0xBF887348 */
  .extern ADCTRGSNSINV     /* 0xBF88734C */
  .extern ADC0TIME         /* 0xBF887350 */
  .extern ADC0TIMECLR      /* 0xBF887354 */
  .extern ADC0TIMESET      /* 0xBF887358 */
  .extern ADC0TIMEINV      /* 0xBF88735C */
  .extern ADC1TIME         /* 0xBF887360 */
  .extern ADC1TIMECLR      /* 0xBF887364 */
  .extern ADC1TIMESET      /* 0xBF887368 */
  .extern ADC1TIMEINV      /* 0xBF88736C */
  .extern ADC2TIME         /* 0xBF887370 */
  .extern ADC2TIMECLR      /* 0xBF887374 */
  .extern ADC2TIMESET      /* 0xBF887378 */
  .extern ADC2TIMEINV      /* 0xBF88737C */
  .extern ADC3TIME         /* 0xBF887380 */
  .extern ADC3TIMECLR      /* 0xBF887384 */
  .extern ADC3TIMESET      /* 0xBF887388 */
  .extern ADC3TIMEINV      /* 0xBF88738C */
  .extern ADC4TIME         /* 0xBF887390 */
  .extern ADC4TIMECLR      /* 0xBF887394 */
  .extern ADC4TIMESET      /* 0xBF887398 */
  .extern ADC4TIMEINV      /* 0xBF88739C */
  .extern ADC5TIME         /* 0xBF8873A0 */
  .extern ADC5TIMECLR      /* 0xBF8873A4 */
  .extern ADC5TIMESET      /* 0xBF8873A8 */
  .extern ADC5TIMEINV      /* 0xBF8873AC */
  .extern ADCEIEN1         /* 0xBF8873C0 */
  .extern ADCEIEN1CLR      /* 0xBF8873C4 */
  .extern ADCEIEN1SET      /* 0xBF8873C8 */
  .extern ADCEIEN1INV      /* 0xBF8873CC */
  .extern ADCEIEN2         /* 0xBF8873D0 */
  .extern ADCEIEN2CLR      /* 0xBF8873D4 */
  .extern ADCEIEN2SET      /* 0xBF8873D8 */
  .extern ADCEIEN2INV      /* 0xBF8873DC */
  .extern ADCEISTAT1       /* 0xBF8873E0 */
  .extern ADCEISTAT1CLR    /* 0xBF8873E4 */
  .extern ADCEISTAT1SET    /* 0xBF8873E8 */
  .extern ADCEISTAT1INV    /* 0xBF8873EC */
  .extern ADCEISTAT2       /* 0xBF8873F0 */
  .extern ADCEISTAT2CLR    /* 0xBF8873F4 */
  .extern ADCEISTAT2SET    /* 0xBF8873F8 */
  .extern ADCEISTAT2INV    /* 0xBF8873FC */
  .extern ADCANCON         /* 0xBF887400 */
  .extern ADCANCONCLR      /* 0xBF887404 */
  .extern ADCANCONSET      /* 0xBF887408 */
  .extern ADCANCONINV      /* 0xBF88740C */
  .extern ADCDATA0         /* 0xBF887600 */
  .extern ADCDATA0CLR      /* 0xBF887604 */
  .extern ADCDATA0SET      /* 0xBF887608 */
  .extern ADCDATA0INV      /* 0xBF88760C */
  .extern ADCDATA1         /* 0xBF887610 */
  .extern ADCDATA1CLR      /* 0xBF887614 */
  .extern ADCDATA1SET      /* 0xBF887618 */
  .extern ADCDATA1INV      /* 0xBF88761C */
  .extern ADCDATA2         /* 0xBF887620 */
  .extern ADCDATA2CLR      /* 0xBF887624 */
  .extern ADCDATA2SET      /* 0xBF887628 */
  .extern ADCDATA2INV      /* 0xBF88762C */
  .extern ADCDATA3         /* 0xBF887630 */
  .extern ADCDATA3CLR      /* 0xBF887634 */
  .extern ADCDATA3SET      /* 0xBF887638 */
  .extern ADCDATA3INV      /* 0xBF88763C */
  .extern ADCDATA4         /* 0xBF887640 */
  .extern ADCDATA4CLR      /* 0xBF887644 */
  .extern ADCDATA4SET      /* 0xBF887648 */
  .extern ADCDATA4INV      /* 0xBF88764C */
  .extern ADCDATA5         /* 0xBF887650 */
  .extern ADCDATA5CLR      /* 0xBF887654 */
  .extern ADCDATA5SET      /* 0xBF887658 */
