Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
#define _IPC5_IC4IS_POSITION                     0x00000008
#define _IPC5_IC4IS_MASK                         0x00000300
#define _IPC5_IC4IS_LENGTH                       0x00000002

#define _IPC5_IC4IP_POSITION                     0x0000000A
#define _IPC5_IC4IP_MASK                         0x00001C00
#define _IPC5_IC4IP_LENGTH                       0x00000003

#define _IPC5_OC4IS_POSITION                     0x00000010
#define _IPC5_OC4IS_MASK                         0x00030000
#define _IPC5_OC4IS_LENGTH                       0x00000002

#define _IPC5_OC4IP_POSITION                     0x00000012
#define _IPC5_OC4IP_MASK                         0x001C0000
#define _IPC5_OC4IP_LENGTH                       0x00000003

#define _IPC5_INT4IS_POSITION                    0x00000018
#define _IPC5_INT4IS_MASK                        0x03000000
#define _IPC5_INT4IS_LENGTH                      0x00000002

#define _IPC5_INT4IP_POSITION                    0x0000001A
#define _IPC5_INT4IP_MASK                        0x1C000000
#define _IPC5_INT4IP_LENGTH                      0x00000003

#define _IPC5_w_POSITION                         0x00000000
#define _IPC5_w_MASK                             0xFFFFFFFF
#define _IPC5_w_LENGTH                           0x00000020

#define _IPC6_T5IS_POSITION                      0x00000000
#define _IPC6_T5IS_MASK                          0x00000003
#define _IPC6_T5IS_LENGTH                        0x00000002

#define _IPC6_T5IP_POSITION                      0x00000002
#define _IPC6_T5IP_MASK                          0x0000001C
#define _IPC6_T5IP_LENGTH                        0x00000003

#define _IPC6_IC5EIS_POSITION                    0x00000008
#define _IPC6_IC5EIS_MASK                        0x00000300
#define _IPC6_IC5EIS_LENGTH                      0x00000002

#define _IPC6_IC5EIP_POSITION                    0x0000000A
#define _IPC6_IC5EIP_MASK                        0x00001C00
#define _IPC6_IC5EIP_LENGTH                      0x00000003

#define _IPC6_IC5IS_POSITION                     0x00000010
#define _IPC6_IC5IS_MASK                         0x00030000
#define _IPC6_IC5IS_LENGTH                       0x00000002

#define _IPC6_IC5IP_POSITION                     0x00000012
#define _IPC6_IC5IP_MASK                         0x001C0000
#define _IPC6_IC5IP_LENGTH                       0x00000003

#define _IPC6_OC5IS_POSITION                     0x00000018
#define _IPC6_OC5IS_MASK                         0x03000000
#define _IPC6_OC5IS_LENGTH                       0x00000002

#define _IPC6_OC5IP_POSITION                     0x0000001A
#define _IPC6_OC5IP_MASK                         0x1C000000
#define _IPC6_OC5IP_LENGTH                       0x00000003

#define _IPC6_w_POSITION                         0x00000000
#define _IPC6_w_MASK                             0xFFFFFFFF
#define _IPC6_w_LENGTH                           0x00000020

#define _IPC7_RTCCIS_POSITION                    0x00000010
#define _IPC7_RTCCIS_MASK                        0x00030000
#define _IPC7_RTCCIS_LENGTH                      0x00000002

#define _IPC7_RTCCIP_POSITION                    0x00000012
#define _IPC7_RTCCIP_MASK                        0x001C0000
#define _IPC7_RTCCIP_LENGTH                      0x00000003

#define _IPC7_FCEIS_POSITION                     0x00000018
#define _IPC7_FCEIS_MASK                         0x03000000
#define _IPC7_FCEIS_LENGTH                       0x00000002

#define _IPC7_FCEIP_POSITION                     0x0000001A
#define _IPC7_FCEIP_MASK                         0x1C000000
#define _IPC7_FCEIP_LENGTH                       0x00000003

#define _IPC7_w_POSITION                         0x00000000
#define _IPC7_w_MASK                             0xFFFFFFFF
#define _IPC7_w_LENGTH                           0x00000020

#define _IPC8_CMP1IS_POSITION                    0x00000000
#define _IPC8_CMP1IS_MASK                        0x00000003
#define _IPC8_CMP1IS_LENGTH                      0x00000002

#define _IPC8_CMP1IP_POSITION                    0x00000002
#define _IPC8_CMP1IP_MASK                        0x0000001C
#define _IPC8_CMP1IP_LENGTH                      0x00000003

#define _IPC8_CMP2IS_POSITION                    0x00000008
#define _IPC8_CMP2IS_MASK                        0x00000300
#define _IPC8_CMP2IS_LENGTH                      0x00000002

#define _IPC8_CMP2IP_POSITION                    0x0000000A
#define _IPC8_CMP2IP_MASK                        0x00001C00
#define _IPC8_CMP2IP_LENGTH                      0x00000003

#define _IPC8_USB1IS_POSITION                    0x00000010
#define _IPC8_USB1IS_MASK                        0x00030000
#define _IPC8_USB1IS_LENGTH                      0x00000002

#define _IPC8_USB1IP_POSITION                    0x00000012
#define _IPC8_USB1IP_MASK                        0x001C0000
#define _IPC8_USB1IP_LENGTH                      0x00000003

#define _IPC8_SPI1EIS_POSITION                   0x00000018
#define _IPC8_SPI1EIS_MASK                       0x03000000
#define _IPC8_SPI1EIS_LENGTH                     0x00000002

#define _IPC8_SPI1EIP_POSITION                   0x0000001A
#define _IPC8_SPI1EIP_MASK                       0x1C000000
#define _IPC8_SPI1EIP_LENGTH                     0x00000003

#define _IPC8_w_POSITION                         0x00000000
#define _IPC8_w_MASK                             0xFFFFFFFF
#define _IPC8_w_LENGTH                           0x00000020

#define _IPC9_SPI1RXIS_POSITION                  0x00000000
#define _IPC9_SPI1RXIS_MASK                      0x00000003
#define _IPC9_SPI1RXIS_LENGTH                    0x00000002

#define _IPC9_SPI1RXIP_POSITION                  0x00000002
#define _IPC9_SPI1RXIP_MASK                      0x0000001C
#define _IPC9_SPI1RXIP_LENGTH                    0x00000003

#define _IPC9_SPI1TXIS_POSITION                  0x00000008
#define _IPC9_SPI1TXIS_MASK                      0x00000300
#define _IPC9_SPI1TXIS_LENGTH                    0x00000002

#define _IPC9_SPI1TXIP_POSITION                  0x0000000A
#define _IPC9_SPI1TXIP_MASK                      0x00001C00
#define _IPC9_SPI1TXIP_LENGTH                    0x00000003

#define _IPC9_U1EIS_POSITION                     0x00000010
#define _IPC9_U1EIS_MASK                         0x00030000
#define _IPC9_U1EIS_LENGTH                       0x00000002

#define _IPC9_U1EIP_POSITION                     0x00000012
#define _IPC9_U1EIP_MASK                         0x001C0000
#define _IPC9_U1EIP_LENGTH                       0x00000003

#define _IPC9_U1RXIS_POSITION                    0x00000018
#define _IPC9_U1RXIS_MASK                        0x03000000
#define _IPC9_U1RXIS_LENGTH                      0x00000002

#define _IPC9_U1RXIP_POSITION                    0x0000001A
#define _IPC9_U1RXIP_MASK                        0x1C000000
#define _IPC9_U1RXIP_LENGTH                      0x00000003

