Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
#define _IPC44_PWM6IS_POSITION                   0x00000010
#define _IPC44_PWM6IS_MASK                       0x00030000
#define _IPC44_PWM6IS_LENGTH                     0x00000002

#define _IPC44_PWM6IP_POSITION                   0x00000012
#define _IPC44_PWM6IP_MASK                       0x001C0000
#define _IPC44_PWM6IP_LENGTH                     0x00000003

#define _IPC44_I2C3BIS_POSITION                  0x00000018
#define _IPC44_I2C3BIS_MASK                      0x03000000
#define _IPC44_I2C3BIS_LENGTH                    0x00000002

#define _IPC44_I2C3BIP_POSITION                  0x0000001A
#define _IPC44_I2C3BIP_MASK                      0x1C000000
#define _IPC44_I2C3BIP_LENGTH                    0x00000003

#define _IPC44_w_POSITION                        0x00000000
#define _IPC44_w_MASK                            0xFFFFFFFF
#define _IPC44_w_LENGTH                          0x00000020

#define _IPC45_I2C3SIS_POSITION                  0x00000000
#define _IPC45_I2C3SIS_MASK                      0x00000003
#define _IPC45_I2C3SIS_LENGTH                    0x00000002

#define _IPC45_I2C3SIP_POSITION                  0x00000002
#define _IPC45_I2C3SIP_MASK                      0x0000001C
#define _IPC45_I2C3SIP_LENGTH                    0x00000003

#define _IPC45_I2C3MIS_POSITION                  0x00000008
#define _IPC45_I2C3MIS_MASK                      0x00000300
#define _IPC45_I2C3MIS_LENGTH                    0x00000002

#define _IPC45_I2C3MIP_POSITION                  0x0000000A
#define _IPC45_I2C3MIP_MASK                      0x00001C00
#define _IPC45_I2C3MIP_LENGTH                    0x00000003

#define _IPC45_DMA4IS_POSITION                   0x00000010
#define _IPC45_DMA4IS_MASK                       0x00030000
#define _IPC45_DMA4IS_LENGTH                     0x00000002

#define _IPC45_DMA4IP_POSITION                   0x00000012
#define _IPC45_DMA4IP_MASK                       0x001C0000
#define _IPC45_DMA4IP_LENGTH                     0x00000003

#define _IPC45_DMA5IS_POSITION                   0x00000018
#define _IPC45_DMA5IS_MASK                       0x03000000
#define _IPC45_DMA5IS_LENGTH                     0x00000002

#define _IPC45_DMA5IP_POSITION                   0x0000001A
#define _IPC45_DMA5IP_MASK                       0x1C000000
#define _IPC45_DMA5IP_LENGTH                     0x00000003

#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_DMA6IS_POSITION                   0x00000000
#define _IPC46_DMA6IS_MASK                       0x00000003
#define _IPC46_DMA6IS_LENGTH                     0x00000002

#define _IPC46_DMA6IP_POSITION                   0x00000002
#define _IPC46_DMA6IP_MASK                       0x0000001C
#define _IPC46_DMA6IP_LENGTH                     0x00000003

#define _IPC46_DMA7IS_POSITION                   0x00000008
#define _IPC46_DMA7IS_MASK                       0x00000300
#define _IPC46_DMA7IS_LENGTH                     0x00000002

#define _IPC46_DMA7IP_POSITION                   0x0000000A
#define _IPC46_DMA7IP_MASK                       0x00001C00
#define _IPC46_DMA7IP_LENGTH                     0x00000003

#define _IPC46_DATAEEIS_POSITION                 0x00000010
#define _IPC46_DATAEEIS_MASK                     0x00030000
#define _IPC46_DATAEEIS_LENGTH                   0x00000002

#define _IPC46_DATAEEIP_POSITION                 0x00000012
#define _IPC46_DATAEEIP_MASK                     0x001C0000
#define _IPC46_DATAEEIP_LENGTH                   0x00000003

#define _IPC46_CAN3IS_POSITION                   0x00000018
#define _IPC46_CAN3IS_MASK                       0x03000000
#define _IPC46_CAN3IS_LENGTH                     0x00000002

#define _IPC46_CAN3IP_POSITION                   0x0000001A
#define _IPC46_CAN3IP_MASK                       0x1C000000
#define _IPC46_CAN3IP_LENGTH                     0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_CAN4IS_POSITION                   0x00000000
#define _IPC47_CAN4IS_MASK                       0x00000003
#define _IPC47_CAN4IS_LENGTH                     0x00000002

#define _IPC47_CAN4IP_POSITION                   0x00000002
#define _IPC47_CAN4IP_MASK                       0x0000001C
#define _IPC47_CAN4IP_LENGTH                     0x00000003

#define _IPC47_QEI3IS_POSITION                   0x00000008
#define _IPC47_QEI3IS_MASK                       0x00000300
#define _IPC47_QEI3IS_LENGTH                     0x00000002

#define _IPC47_QEI3IP_POSITION                   0x0000000A
#define _IPC47_QEI3IP_MASK                       0x00001C00
#define _IPC47_QEI3IP_LENGTH                     0x00000003

#define _IPC47_QEI4IS_POSITION                   0x00000010
#define _IPC47_QEI4IS_MASK                       0x00030000
#define _IPC47_QEI4IS_LENGTH                     0x00000002

#define _IPC47_QEI4IP_POSITION                   0x00000012
#define _IPC47_QEI4IP_MASK                       0x001C0000
#define _IPC47_QEI4IP_LENGTH                     0x00000003

#define _IPC47_QEI5IS_POSITION                   0x00000018
#define _IPC47_QEI5IS_MASK                       0x03000000
#define _IPC47_QEI5IS_LENGTH                     0x00000002

#define _IPC47_QEI5IP_POSITION                   0x0000001A
#define _IPC47_QEI5IP_MASK                       0x1C000000
#define _IPC47_QEI5IP_LENGTH                     0x00000003

#define _IPC47_w_POSITION                        0x00000000
#define _IPC47_w_MASK                            0xFFFFFFFF
#define _IPC47_w_LENGTH                          0x00000020

#define _IPC48_QEI6IS_POSITION                   0x00000000
#define _IPC48_QEI6IS_MASK                       0x00000003
#define _IPC48_QEI6IS_LENGTH                     0x00000002

#define _IPC48_QEI6IP_POSITION                   0x00000002
#define _IPC48_QEI6IP_MASK                       0x0000001C
#define _IPC48_QEI6IP_LENGTH                     0x00000003

