Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
#define _IPC48_I2C4BIS_POSITION                  0x00000010
#define _IPC48_I2C4BIS_MASK                      0x00030000
#define _IPC48_I2C4BIS_LENGTH                    0x00000002

#define _IPC48_I2C4BIP_POSITION                  0x00000012
#define _IPC48_I2C4BIP_MASK                      0x001C0000
#define _IPC48_I2C4BIP_LENGTH                    0x00000003

#define _IPC48_I2C4SIS_POSITION                  0x00000018
#define _IPC48_I2C4SIS_MASK                      0x03000000
#define _IPC48_I2C4SIS_LENGTH                    0x00000002

#define _IPC48_I2C4SIP_POSITION                  0x0000001A
#define _IPC48_I2C4SIP_MASK                      0x1C000000
#define _IPC48_I2C4SIP_LENGTH                    0x00000003

#define _IPC48_w_POSITION                        0x00000000
#define _IPC48_w_MASK                            0xFFFFFFFF
#define _IPC48_w_LENGTH                          0x00000020

#define _IPC49_I2C4MIS_POSITION                  0x00000000
#define _IPC49_I2C4MIS_MASK                      0x00000003
#define _IPC49_I2C4MIS_LENGTH                    0x00000002

#define _IPC49_I2C4MIP_POSITION                  0x00000002
#define _IPC49_I2C4MIP_MASK                      0x0000001C
#define _IPC49_I2C4MIP_LENGTH                    0x00000003

#define _IPC49_IC10EIS_POSITION                  0x00000008
#define _IPC49_IC10EIS_MASK                      0x00000300
#define _IPC49_IC10EIS_LENGTH                    0x00000002

#define _IPC49_IC10EIP_POSITION                  0x0000000A
#define _IPC49_IC10EIP_MASK                      0x00001C00
#define _IPC49_IC10EIP_LENGTH                    0x00000003

#define _IPC49_IC10IS_POSITION                   0x00000010
#define _IPC49_IC10IS_MASK                       0x00030000
#define _IPC49_IC10IS_LENGTH                     0x00000002

#define _IPC49_IC10IP_POSITION                   0x00000012
#define _IPC49_IC10IP_MASK                       0x001C0000
#define _IPC49_IC10IP_LENGTH                     0x00000003

#define _IPC49_OC10IS_POSITION                   0x00000018
#define _IPC49_OC10IS_MASK                       0x03000000
#define _IPC49_OC10IS_LENGTH                     0x00000002

#define _IPC49_OC10IP_POSITION                   0x0000001A
#define _IPC49_OC10IP_MASK                       0x1C000000
#define _IPC49_OC10IP_LENGTH                     0x00000003

#define _IPC49_w_POSITION                        0x00000000
#define _IPC49_w_MASK                            0xFFFFFFFF
#define _IPC49_w_LENGTH                          0x00000020

#define _IPC50_IC11EIS_POSITION                  0x00000000
#define _IPC50_IC11EIS_MASK                      0x00000003
#define _IPC50_IC11EIS_LENGTH                    0x00000002

#define _IPC50_IC11EIP_POSITION                  0x00000002
#define _IPC50_IC11EIP_MASK                      0x0000001C
#define _IPC50_IC11EIP_LENGTH                    0x00000003

#define _IPC50_IC11IS_POSITION                   0x00000008
#define _IPC50_IC11IS_MASK                       0x00000300
#define _IPC50_IC11IS_LENGTH                     0x00000002

#define _IPC50_IC11IP_POSITION                   0x0000000A
#define _IPC50_IC11IP_MASK                       0x00001C00
#define _IPC50_IC11IP_LENGTH                     0x00000003

#define _IPC50_OC11IS_POSITION                   0x00000010
#define _IPC50_OC11IS_MASK                       0x00030000
#define _IPC50_OC11IS_LENGTH                     0x00000002

#define _IPC50_OC11IP_POSITION                   0x00000012
#define _IPC50_OC11IP_MASK                       0x001C0000
#define _IPC50_OC11IP_LENGTH                     0x00000003

#define _IPC50_IC12EIS_POSITION                  0x00000018
#define _IPC50_IC12EIS_MASK                      0x03000000
#define _IPC50_IC12EIS_LENGTH                    0x00000002

#define _IPC50_IC12EIP_POSITION                  0x0000001A
#define _IPC50_IC12EIP_MASK                      0x1C000000
#define _IPC50_IC12EIP_LENGTH                    0x00000003

#define _IPC50_w_POSITION                        0x00000000
#define _IPC50_w_MASK                            0xFFFFFFFF
#define _IPC50_w_LENGTH                          0x00000020

#define _IPC51_IC12IS_POSITION                   0x00000000
#define _IPC51_IC12IS_MASK                       0x00000003
#define _IPC51_IC12IS_LENGTH                     0x00000002

#define _IPC51_IC12IP_POSITION                   0x00000002
#define _IPC51_IC12IP_MASK                       0x0000001C
#define _IPC51_IC12IP_LENGTH                     0x00000003

#define _IPC51_OC12IS_POSITION                   0x00000008
#define _IPC51_OC12IS_MASK                       0x00000300
#define _IPC51_OC12IS_LENGTH                     0x00000002

#define _IPC51_OC12IP_POSITION                   0x0000000A
#define _IPC51_OC12IP_MASK                       0x00001C00
#define _IPC51_OC12IP_LENGTH                     0x00000003

#define _IPC51_IC13EIS_POSITION                  0x00000010
#define _IPC51_IC13EIS_MASK                      0x00030000
#define _IPC51_IC13EIS_LENGTH                    0x00000002

#define _IPC51_IC13EIP_POSITION                  0x00000012
#define _IPC51_IC13EIP_MASK                      0x001C0000
#define _IPC51_IC13EIP_LENGTH                    0x00000003

#define _IPC51_IC13IS_POSITION                   0x00000018
#define _IPC51_IC13IS_MASK                       0x03000000
#define _IPC51_IC13IS_LENGTH                     0x00000002

#define _IPC51_IC13IP_POSITION                   0x0000001A
#define _IPC51_IC13IP_MASK                       0x1C000000
#define _IPC51_IC13IP_LENGTH                     0x00000003

#define _IPC51_w_POSITION                        0x00000000
#define _IPC51_w_MASK                            0xFFFFFFFF
#define _IPC51_w_LENGTH                          0x00000020

#define _IPC52_OC13IS_POSITION                   0x00000000
#define _IPC52_OC13IS_MASK                       0x00000003
#define _IPC52_OC13IS_LENGTH                     0x00000002

#define _IPC52_OC13IP_POSITION                   0x00000002
#define _IPC52_OC13IP_MASK                       0x0000001C
#define _IPC52_OC13IP_LENGTH                     0x00000003

#define _IPC52_IC14EIS_POSITION                  0x00000008
#define _IPC52_IC14EIS_MASK                      0x00000300
#define _IPC52_IC14EIS_LENGTH                    0x00000002

#define _IPC52_IC14EIP_POSITION                  0x0000000A
#define _IPC52_IC14EIP_MASK                      0x00001C00
#define _IPC52_IC14EIP_LENGTH                    0x00000003

