Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
#define _IPC56_SPI5TXIS_POSITION                 0x00000010
#define _IPC56_SPI5TXIS_MASK                     0x00030000
#define _IPC56_SPI5TXIS_LENGTH                   0x00000002

#define _IPC56_SPI5TXIP_POSITION                 0x00000012
#define _IPC56_SPI5TXIP_MASK                     0x001C0000
#define _IPC56_SPI5TXIP_LENGTH                   0x00000003

#define _IPC56_SPI6EIS_POSITION                  0x00000018
#define _IPC56_SPI6EIS_MASK                      0x03000000
#define _IPC56_SPI6EIS_LENGTH                    0x00000002

#define _IPC56_SPI6EIP_POSITION                  0x0000001A
#define _IPC56_SPI6EIP_MASK                      0x1C000000
#define _IPC56_SPI6EIP_LENGTH                    0x00000003

#define _IPC56_w_POSITION                        0x00000000
#define _IPC56_w_MASK                            0xFFFFFFFF
#define _IPC56_w_LENGTH                          0x00000020

#define _IPC57_SPI6RXIS_POSITION                 0x00000000
#define _IPC57_SPI6RXIS_MASK                     0x00000003
#define _IPC57_SPI6RXIS_LENGTH                   0x00000002

#define _IPC57_SPI6RXIP_POSITION                 0x00000002
#define _IPC57_SPI6RXIP_MASK                     0x0000001C
#define _IPC57_SPI6RXIP_LENGTH                   0x00000003

#define _IPC57_SPI6TXIS_POSITION                 0x00000008
#define _IPC57_SPI6TXIS_MASK                     0x00000300
#define _IPC57_SPI6TXIS_LENGTH                   0x00000002

#define _IPC57_SPI6TXIP_POSITION                 0x0000000A
#define _IPC57_SPI6TXIP_MASK                     0x00001C00
#define _IPC57_SPI6TXIP_LENGTH                   0x00000003

#define _IPC57_SBIS_POSITION                     0x00000010
#define _IPC57_SBIS_MASK                         0x00030000
#define _IPC57_SBIS_LENGTH                       0x00000002

#define _IPC57_SBIP_POSITION                     0x00000012
#define _IPC57_SBIP_MASK                         0x001C0000
#define _IPC57_SBIP_LENGTH                       0x00000003

#define _IPC57_w_POSITION                        0x00000000
#define _IPC57_w_MASK                            0xFFFFFFFF
#define _IPC57_w_LENGTH                          0x00000020

#define _IPC58_w_POSITION                        0x00000000
#define _IPC58_w_MASK                            0xFFFFFFFF
#define _IPC58_w_LENGTH                          0x00000020

#define _IPC59_PWM7IS_POSITION                   0x00000010
#define _IPC59_PWM7IS_MASK                       0x00030000
#define _IPC59_PWM7IS_LENGTH                     0x00000002

#define _IPC59_PWM7IP_POSITION                   0x00000012
#define _IPC59_PWM7IP_MASK                       0x001C0000
#define _IPC59_PWM7IP_LENGTH                     0x00000003

#define _IPC59_PWM8IS_POSITION                   0x00000018
#define _IPC59_PWM8IS_MASK                       0x03000000
#define _IPC59_PWM8IS_LENGTH                     0x00000002

#define _IPC59_PWM8IP_POSITION                   0x0000001A
#define _IPC59_PWM8IP_MASK                       0x1C000000
#define _IPC59_PWM8IP_LENGTH                     0x00000003

#define _IPC59_w_POSITION                        0x00000000
#define _IPC59_w_MASK                            0xFFFFFFFF
#define _IPC59_w_LENGTH                          0x00000020

#define _IPC60_PWM9IS_POSITION                   0x00000000
#define _IPC60_PWM9IS_MASK                       0x00000003
#define _IPC60_PWM9IS_LENGTH                     0x00000002

#define _IPC60_PWM9IP_POSITION                   0x00000002
#define _IPC60_PWM9IP_MASK                       0x0000001C
#define _IPC60_PWM9IP_LENGTH                     0x00000003

#define _IPC60_PWM10IS_POSITION                  0x00000008
#define _IPC60_PWM10IS_MASK                      0x00000300
#define _IPC60_PWM10IS_LENGTH                    0x00000002

#define _IPC60_PWM10IP_POSITION                  0x0000000A
#define _IPC60_PWM10IP_MASK                      0x00001C00
#define _IPC60_PWM10IP_LENGTH                    0x00000003

#define _IPC60_PWM11IS_POSITION                  0x00000010
#define _IPC60_PWM11IS_MASK                      0x00030000
#define _IPC60_PWM11IS_LENGTH                    0x00000002

#define _IPC60_PWM11IP_POSITION                  0x00000012
#define _IPC60_PWM11IP_MASK                      0x001C0000
#define _IPC60_PWM11IP_LENGTH                    0x00000003

#define _IPC60_PWM12IS_POSITION                  0x00000018
#define _IPC60_PWM12IS_MASK                      0x03000000
#define _IPC60_PWM12IS_LENGTH                    0x00000002

#define _IPC60_PWM12IP_POSITION                  0x0000001A
#define _IPC60_PWM12IP_MASK                      0x1C000000
#define _IPC60_PWM12IP_LENGTH                    0x00000003

#define _IPC60_w_POSITION                        0x00000000
#define _IPC60_w_MASK                            0xFFFFFFFF
#define _IPC60_w_LENGTH                          0x00000020

#define _IPC61_USB2IS_POSITION                   0x00000000
#define _IPC61_USB2IS_MASK                       0x00000003
#define _IPC61_USB2IS_LENGTH                     0x00000002

#define _IPC61_USB2IP_POSITION                   0x00000002
#define _IPC61_USB2IP_MASK                       0x0000001C
#define _IPC61_USB2IP_LENGTH                     0x00000003

#define _IPC61_AD1DC3IS_POSITION                 0x00000008
#define _IPC61_AD1DC3IS_MASK                     0x00000300
#define _IPC61_AD1DC3IS_LENGTH                   0x00000002

#define _IPC61_AD1DC3IP_POSITION                 0x0000000A
#define _IPC61_AD1DC3IP_MASK                     0x00001C00
#define _IPC61_AD1DC3IP_LENGTH                   0x00000003

#define _IPC61_AD1DC4IS_POSITION                 0x00000010
#define _IPC61_AD1DC4IS_MASK                     0x00030000
#define _IPC61_AD1DC4IS_LENGTH                   0x00000002

#define _IPC61_AD1DC4IP_POSITION                 0x00000012
#define _IPC61_AD1DC4IP_MASK                     0x001C0000
#define _IPC61_AD1DC4IP_LENGTH                   0x00000003

#define _IPC61_PCACHEIS_POSITION                 0x00000018
#define _IPC61_PCACHEIS_MASK                     0x03000000
#define _IPC61_PCACHEIS_LENGTH                   0x00000002

