Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
#define _CNSTATA_CNSTATA0_POSITION               0x00000000
#define _CNSTATA_CNSTATA0_MASK                   0x00000001
#define _CNSTATA_CNSTATA0_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA1_POSITION               0x00000001
#define _CNSTATA_CNSTATA1_MASK                   0x00000002
#define _CNSTATA_CNSTATA1_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA4_POSITION               0x00000004
#define _CNSTATA_CNSTATA4_MASK                   0x00000010
#define _CNSTATA_CNSTATA4_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA7_POSITION               0x00000007
#define _CNSTATA_CNSTATA7_MASK                   0x00000080
#define _CNSTATA_CNSTATA7_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA8_POSITION               0x00000008
#define _CNSTATA_CNSTATA8_MASK                   0x00000100
#define _CNSTATA_CNSTATA8_LENGTH                 0x00000001

#define _CNSTATA_CNSTATA10_POSITION              0x0000000A
#define _CNSTATA_CNSTATA10_MASK                  0x00000400
#define _CNSTATA_CNSTATA10_LENGTH                0x00000001

#define _CNSTATA_CNSTATA11_POSITION              0x0000000B
#define _CNSTATA_CNSTATA11_MASK                  0x00000800
#define _CNSTATA_CNSTATA11_LENGTH                0x00000001

#define _CNSTATA_CNSTATA12_POSITION              0x0000000C
#define _CNSTATA_CNSTATA12_MASK                  0x00001000
#define _CNSTATA_CNSTATA12_LENGTH                0x00000001

#define _CNSTATA_w_POSITION                      0x00000000
#define _CNSTATA_w_MASK                          0xFFFFFFFF
#define _CNSTATA_w_LENGTH                        0x00000020

#define _CNNEA_CNNEA0_POSITION                   0x00000000
#define _CNNEA_CNNEA0_MASK                       0x00000001
#define _CNNEA_CNNEA0_LENGTH                     0x00000001

#define _CNNEA_CNNEA1_POSITION                   0x00000001
#define _CNNEA_CNNEA1_MASK                       0x00000002
#define _CNNEA_CNNEA1_LENGTH                     0x00000001

#define _CNNEA_CNNEA4_POSITION                   0x00000004
#define _CNNEA_CNNEA4_MASK                       0x00000010
#define _CNNEA_CNNEA4_LENGTH                     0x00000001

#define _CNNEA_CNNEA7_POSITION                   0x00000007
#define _CNNEA_CNNEA7_MASK                       0x00000080
#define _CNNEA_CNNEA7_LENGTH                     0x00000001

#define _CNNEA_CNNEA8_POSITION                   0x00000008
#define _CNNEA_CNNEA8_MASK                       0x00000100
#define _CNNEA_CNNEA8_LENGTH                     0x00000001

#define _CNNEA_CNNEA10_POSITION                  0x0000000A
#define _CNNEA_CNNEA10_MASK                      0x00000400
#define _CNNEA_CNNEA10_LENGTH                    0x00000001

#define _CNNEA_CNNEA11_POSITION                  0x0000000B
#define _CNNEA_CNNEA11_MASK                      0x00000800
#define _CNNEA_CNNEA11_LENGTH                    0x00000001

#define _CNNEA_CNNEA12_POSITION                  0x0000000C
#define _CNNEA_CNNEA12_MASK                      0x00001000
#define _CNNEA_CNNEA12_LENGTH                    0x00000001

#define _CNFA_CNFA0_POSITION                     0x00000000
#define _CNFA_CNFA0_MASK                         0x00000001
#define _CNFA_CNFA0_LENGTH                       0x00000001

#define _CNFA_CNFA1_POSITION                     0x00000001
#define _CNFA_CNFA1_MASK                         0x00000002
#define _CNFA_CNFA1_LENGTH                       0x00000001

#define _CNFA_CNFA4_POSITION                     0x00000004
#define _CNFA_CNFA4_MASK                         0x00000010
#define _CNFA_CNFA4_LENGTH                       0x00000001

#define _CNFA_CNFA7_POSITION                     0x00000007
#define _CNFA_CNFA7_MASK                         0x00000080
#define _CNFA_CNFA7_LENGTH                       0x00000001

#define _CNFA_CNFA8_POSITION                     0x00000008
#define _CNFA_CNFA8_MASK                         0x00000100
#define _CNFA_CNFA8_LENGTH                       0x00000001

#define _CNFA_CNFA10_POSITION                    0x0000000A
#define _CNFA_CNFA10_MASK                        0x00000400
#define _CNFA_CNFA10_LENGTH                      0x00000001

#define _CNFA_CNFA11_POSITION                    0x0000000B
#define _CNFA_CNFA11_MASK                        0x00000800
#define _CNFA_CNFA11_LENGTH                      0x00000001

#define _CNFA_CNFA12_POSITION                    0x0000000C
#define _CNFA_CNFA12_MASK                        0x00001000
#define _CNFA_CNFA12_LENGTH                      0x00000001

#define _SRCON0A_SR0A7_POSITION                  0x00000007
#define _SRCON0A_SR0A7_MASK                      0x00000080
#define _SRCON0A_SR0A7_LENGTH                    0x00000001

#define _SRCON0A_SR0A8_POSITION                  0x00000008
#define _SRCON0A_SR0A8_MASK                      0x00000100
#define _SRCON0A_SR0A8_LENGTH                    0x00000001

#define _SRCON0A_SR0A10_POSITION                 0x0000000A
#define _SRCON0A_SR0A10_MASK                     0x00000400
#define _SRCON0A_SR0A10_LENGTH                   0x00000001

#define _SRCON1A_SR1A7_POSITION                  0x00000007
#define _SRCON1A_SR1A7_MASK                      0x00000080
#define _SRCON1A_SR1A7_LENGTH                    0x00000001

#define _SRCON1A_SR1A8_POSITION                  0x00000008
#define _SRCON1A_SR1A8_MASK                      0x00000100
#define _SRCON1A_SR1A8_LENGTH                    0x00000001

#define _SRCON1A_SR1A10_POSITION                 0x0000000A
#define _SRCON1A_SR1A10_MASK                     0x00000400
#define _SRCON1A_SR1A10_LENGTH                   0x00000001

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

