Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpk064.h
#define _AUBADEVCFG0_POSCBOOST_POSITION          0x00000015
#define _AUBADEVCFG0_POSCBOOST_MASK              0x00200000
#define _AUBADEVCFG0_POSCBOOST_LENGTH            0x00000001

#define _AUBADEVCFG0_POSCFGAIN_POSITION          0x00000016
#define _AUBADEVCFG0_POSCFGAIN_MASK              0x00C00000
#define _AUBADEVCFG0_POSCFGAIN_LENGTH            0x00000002

#define _AUBADEVCFG0_POSCAGCDLY_POSITION         0x00000018
#define _AUBADEVCFG0_POSCAGCDLY_MASK             0x03000000
#define _AUBADEVCFG0_POSCAGCDLY_LENGTH           0x00000002

#define _AUBADEVCFG0_POSCAGCRNG_POSITION         0x0000001A
#define _AUBADEVCFG0_POSCAGCRNG_MASK             0x04000000
#define _AUBADEVCFG0_POSCAGCRNG_LENGTH           0x00000001

#define _AUBADEVCFG0_POSCAGC_POSITION            0x0000001B
#define _AUBADEVCFG0_POSCAGC_MASK                0x08000000
#define _AUBADEVCFG0_POSCAGC_LENGTH              0x00000001

#define _AUBADEVCFG0_EJTAGBEN_POSITION           0x0000001E
#define _AUBADEVCFG0_EJTAGBEN_MASK               0x40000000
#define _AUBADEVCFG0_EJTAGBEN_LENGTH             0x00000001

#define _AUBADEVCFG0_FDEBUG_POSITION             0x00000000
#define _AUBADEVCFG0_FDEBUG_MASK                 0x00000003
#define _AUBADEVCFG0_FDEBUG_LENGTH               0x00000002

#define _AUBADEVCFG0_w_POSITION                  0x00000000
#define _AUBADEVCFG0_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG0_w_LENGTH                    0x00000020

#define _AUBADEVCP_CP_POSITION                   0x0000001C
#define _AUBADEVCP_CP_MASK                       0x10000000
#define _AUBADEVCP_CP_LENGTH                     0x00000001

#define _AUBADEVCP_w_POSITION                    0x00000000
#define _AUBADEVCP_w_MASK                        0xFFFFFFFF
#define _AUBADEVCP_w_LENGTH                      0x00000020

#define _AUBASEQ_TSEQ_POSITION                   0x00000000
#define _AUBASEQ_TSEQ_MASK                       0x0000FFFF
#define _AUBASEQ_TSEQ_LENGTH                     0x00000010

#define _AUBASEQ_CSEQ_POSITION                   0x00000010
#define _AUBASEQ_CSEQ_MASK                       0xFFFF0000
#define _AUBASEQ_CSEQ_LENGTH                     0x00000010

#define _AUBASEQ_w_POSITION                      0x00000000
#define _AUBASEQ_w_MASK                          0xFFFFFFFF
#define _AUBASEQ_w_LENGTH                        0x00000020

#define _UBADEVCFG3_USERID_POSITION              0x00000000
#define _UBADEVCFG3_USERID_MASK                  0x0000FFFF
#define _UBADEVCFG3_USERID_LENGTH                0x00000010

#define _UBADEVCFG3_FUSBIDIO2_POSITION           0x00000016
#define _UBADEVCFG3_FUSBIDIO2_MASK               0x00400000
#define _UBADEVCFG3_FUSBIDIO2_LENGTH             0x00000001

#define _UBADEVCFG3_FVBUSIO2_POSITION            0x00000017
#define _UBADEVCFG3_FVBUSIO2_MASK                0x00800000
#define _UBADEVCFG3_FVBUSIO2_LENGTH              0x00000001

#define _UBADEVCFG3_PGL1WAY_POSITION             0x0000001B
#define _UBADEVCFG3_PGL1WAY_MASK                 0x08000000
#define _UBADEVCFG3_PGL1WAY_LENGTH               0x00000001

#define _UBADEVCFG3_PMDL1WAY_POSITION            0x0000001C
#define _UBADEVCFG3_PMDL1WAY_MASK                0x10000000
#define _UBADEVCFG3_PMDL1WAY_LENGTH              0x00000001

#define _UBADEVCFG3_IOL1WAY_POSITION             0x0000001D
#define _UBADEVCFG3_IOL1WAY_MASK                 0x20000000
#define _UBADEVCFG3_IOL1WAY_LENGTH               0x00000001

#define _UBADEVCFG3_FUSBIDIO1_POSITION           0x0000001E
#define _UBADEVCFG3_FUSBIDIO1_MASK               0x40000000
#define _UBADEVCFG3_FUSBIDIO1_LENGTH             0x00000001

#define _UBADEVCFG3_FVBUSIO1_POSITION            0x0000001F
#define _UBADEVCFG3_FVBUSIO1_MASK                0x80000000
#define _UBADEVCFG3_FVBUSIO1_LENGTH              0x00000001

#define _UBADEVCFG3_w_POSITION                   0x00000000
#define _UBADEVCFG3_w_MASK                       0xFFFFFFFF
#define _UBADEVCFG3_w_LENGTH                     0x00000020

#define _UBADEVCFG2_FPLLIDIV_POSITION            0x00000000
#define _UBADEVCFG2_FPLLIDIV_MASK                0x00000007
#define _UBADEVCFG2_FPLLIDIV_LENGTH              0x00000003

#define _UBADEVCFG2_FPLLRNG_POSITION             0x00000004
#define _UBADEVCFG2_FPLLRNG_MASK                 0x00000070
#define _UBADEVCFG2_FPLLRNG_LENGTH               0x00000003

#define _UBADEVCFG2_FPLLICLK_POSITION            0x00000007
#define _UBADEVCFG2_FPLLICLK_MASK                0x00000080
#define _UBADEVCFG2_FPLLICLK_LENGTH              0x00000001

#define _UBADEVCFG2_FPLLMULT_POSITION            0x00000008
#define _UBADEVCFG2_FPLLMULT_MASK                0x00007F00
#define _UBADEVCFG2_FPLLMULT_LENGTH              0x00000007

#define _UBADEVCFG2_FPLLODIV_POSITION            0x00000010
#define _UBADEVCFG2_FPLLODIV_MASK                0x00070000
#define _UBADEVCFG2_FPLLODIV_LENGTH              0x00000003

#define _UBADEVCFG2_DSBOREN_POSITION             0x00000014
#define _UBADEVCFG2_DSBOREN_MASK                 0x00100000
#define _UBADEVCFG2_DSBOREN_LENGTH               0x00000001

#define _UBADEVCFG2_DSWDTPS_POSITION             0x00000015
#define _UBADEVCFG2_DSWDTPS_MASK                 0x03E00000
#define _UBADEVCFG2_DSWDTPS_LENGTH               0x00000005

#define _UBADEVCFG2_DSWDTOSC_POSITION            0x0000001A
#define _UBADEVCFG2_DSWDTOSC_MASK                0x04000000
#define _UBADEVCFG2_DSWDTOSC_LENGTH              0x00000001

#define _UBADEVCFG2_DSWDTEN_POSITION             0x0000001B
#define _UBADEVCFG2_DSWDTEN_MASK                 0x08000000
#define _UBADEVCFG2_DSWDTEN_LENGTH               0x00000001

#define _UBADEVCFG2_FDSEN_POSITION               0x0000001C
#define _UBADEVCFG2_FDSEN_MASK                   0x10000000
#define _UBADEVCFG2_FDSEN_LENGTH                 0x00000001

#define _UBADEVCFG2_BORSEL_POSITION              0x0000001D
#define _UBADEVCFG2_BORSEL_MASK                  0x20000000
#define _UBADEVCFG2_BORSEL_LENGTH                0x00000001

#define _UBADEVCFG2_UPLLEN_POSITION              0x0000001F
#define _UBADEVCFG2_UPLLEN_MASK                  0x80000000
#define _UBADEVCFG2_UPLLEN_LENGTH                0x00000001

#define _UBADEVCFG2_w_POSITION                   0x00000000
#define _UBADEVCFG2_w_MASK                       0xFFFFFFFF
#define _UBADEVCFG2_w_LENGTH                     0x00000020

